# Ultralytics YOLO 🚀, AGPL-3.0 license
# Ablation Study: YOLO11 + EFE(with MDTE) + Standard Concat Head (NO GCAI)
nc: 8
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4

  # Layer 2: EFE 模块 (内部已集成 MDTE_Conv，替换了 Sobel)
  - [-1, 2, C3k2_EFE, [256, False, 0.25]] # 2-P2/4

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_EFE, [512, False, 0.25]] # 4-P3/8

  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_EFE, [1024, True]] # 6-P4/16
  - [-1, 1, DynamicResidualGroup, [1024]] # 7-P4/16 (DRG)
  - [-1, 1, SPPF, [1024, 5]] # 8-P4/16

head:
  # === 上采样路径 (FPN) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 4], 1, Concat, [1]] # 10 (cat P3)
  - [-1, 2, C3k2, [512, False]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12

  # === 消融实验关键点：这里不使用 GCAI，而是标准的 Concat ===
  # [-1] 是当前上采样特征, [2] 是 Backbone P2 (含 MDTE 的 EFE 输出)
  - [[-1, 2], 1, Concat, [1]] # 13 (标准 Concat)

  - [-1, 2, C3k2, [256, False]] # 14

  # === 下采样路径 (PAN) ===
  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16
  - [-1, 2, C3k2, [512, False]] # 17

  - [-1, 1, Conv, [512, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19
  - [-1, 2, C3k2, [1024, False]] # 20

  - [[14, 17, 20], 1, Detect, [nc]] # 21