# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-IRSTD-Architecture-Improved with GCAI & DRG
nc: 8
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (Stride 2)
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (Stride 4)
  - [-1, 2, C3k2_EFE, [256, False, 0.25]] # 2-P2/4 (特征提取)
  - [-1, 1, MDTE_Simplified, [256]] # 3-P2/4 (MDTE增强，Stride 4) -> 【作为 GCAI 的 Low Input】

  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8 (Stride 8)
  - [-1, 2, C3k2_EFE, [512, False, 0.25]] # 5-P3/8 -> 【作为 Head P3 的 Concat 来源】

  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (Stride 16)
  - [-1, 2, C3k2_EFE, [1024, True]] # 7-P4/16
  - [-1, 1, DynamicResidualGroup, [1024]] # 8-P4/16 (DRG增强)
  - [-1, 1, SPPF, [1024, 5]] # 9-P4/16 (Stride 16) -> 【Backbone 输出】

head:
  # === 上采样路径 (FPN) ===

  # 10. Upsample P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (Stride 8)
  - [[-1, 5], 1, Concat, [1]] # 11 (拼接 Layer 5, Stride 8)
  - [-1, 2, C3k2, [512, False]] # 12 (P3 特征)

  # 13. Upsample P3 -> P2 (准备与 Low-level 融合)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (Stride 4)

  # 14. GCAI 融合 (代替普通的 Concat)
  # Low Input: 3 (MDTE增强后的 Stride 4 特征)
  # High Input: -1 (当前 Layer 13 的上采样特征)
  - [[3, -1], 1, GCAI_Fusion, [256]] # 14 (Stride 4, 输出 P2 特征)

  # 15. P2 处理层 (这是检测微小目标的关键层)
  - [-1, 2, C3k2, [256, False]] # 15 (P2 Detect Head 输入)

  # === 下采样路径 (PAN) ===

  # 16. Downsample P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]] # 16 (Stride 8)
  - [[-1, 12], 1, Concat, [1]] # 17 (拼接 Layer 12)
  - [-1, 2, C3k2, [512, False]] # 18 (P3 Detect Head 输入)

  # 19. Downsample P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]] # 19 (Stride 16)
  - [[-1, 9], 1, Concat, [1]] # 20 (拼接 Layer 9)
  - [-1, 2, C3k2, [1024, False]] # 21 (P4 Detect Head 输入)

  # 22. Detect (三个输出头：P2, P3, P4)
  - [[15, 18, 21], 1, Detect, [nc]]