# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-IRSTD-Architecture-Improved (修正版)
nc: 8
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4

  # Layer 2: 这里的 EFE 内部已经集成了 MDTE，所以它输出的特征既有边缘又有语义
  - [-1, 2, C3k2_EFE, [256, False, 0.25]] # 2-P2/4 (Low Input 来源)

  # 【删除】原来的 Layer 3 (MDTE_Conv)，因为它会破坏主干语义流

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8 (注意：现在它直接接 Layer 2)
  - [-1, 2, C3k2_EFE, [512, False, 0.25]] # 4-P3/8

  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_EFE, [1024, True]] # 6-P4/16
  - [-1, 1, DynamicResidualGroup, [1024]] # 7-P4/16 (Backbone末端增强)
  - [-1, 1, SPPF, [1024, 5]] # 8-P4/16

head:
  # === 上采样路径 (FPN) ===

  # Upsample P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 4], 1, Concat, [1]] # 10 (接 Layer 4)
  - [-1, 2, C3k2, [512, False]] # 11

  # Upsample P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12

  # === GCAI 融合 ===
  # Low Input: 2 (Backbone的 P2层，C3k2_EFE 输出)
  # High Input: -1 (当前的深层上采样特征)
  # 修正：这里 from 变成了 [2, -1]
  - [[2, -1], 1, GCAI_Fusion, [256]] # 13 (GCAI 融合)

  - [-1, 2, C3k2, [256, False]] # 14 (P2 融合后处理)

  # === 下采样路径 (PAN) ===

  # Downsample P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16 (接 Layer 11)
  - [-1, 2, C3k2, [512, False]] # 17

  # Downsample P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19 (接 Layer 8)
  - [-1, 2, C3k2, [1024, False]] # 20

  # Detect
  - [[14, 17, 20], 1, Detect, [nc]] # 21