# Ultralytics YOLO 🚀, AGPL-3.0 license
# M3FD 数据集最优架构: MDTE_Conv + DRG + Concat (无GCAI)

nc: 8
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]

  # 【核心保留】源头杂波清洗
  - [-1, 2, MDTE_Conv, [256]]
  - [-1, 1, Conv, [256, 3, 2]]

  - [-1, 2, C3k2_EFE, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]

  - [-1, 2, C3k2_EFE, [1024, True]]
  - [-1, 1, Conv, [1024, 3, 2]]

  # 【绝对核心】M3FD跑出0.8+的DRG
  - [-1, 1, DynamicResidualGroup, [1024]]

  - [-1, 2, C3k2_EFE, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  # 摒弃GCAI，回归最稳健的Concat拼接
  - [[-1, 6], 1, Concat, [1]]       # 12
  - [-1, 2, C3k2_EFE, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  # 摒弃GCAI，回归最稳健的Concat拼接
  - [[-1, 4], 1, Concat, [1]]       # 15
  - [-1, 2, C3k2_EFE, [256, False]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2_EFE, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2_EFE, [1024, True]]

  - [[16, 19, 22], 1, Detect, [nc]]