# Ultralytics YOLO 🚀, AGPL-3.0 license
nc: 6
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_EFE, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_EFE, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_EFE, [512, True]] # 6-P4/16

  # 【这里就是丢失的降采样层！必须用 stride=2 把图片长宽再缩小一半】
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32

  # 恢复黄金模块，放置在最深层提纯全局语义
  - [-1, 1, DynamicResidualGroup, [1024]] # 8-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  # 恢复原生的 Concat 拼接
  - [[-1, 6], 1, Concat, [1]] # 10
  - [-1, 2, C3k2, [512, False]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13
  - [-1, 2, C3k2, [256, False]] # 14

  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16
  - [-1, 2, C3k2, [512, False]] # 17

  - [-1, 1, Conv, [512, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19
  - [-1, 2, C3k2, [1024, False]] # 20

  - [[14, 17, 20], 1, Detect, [nc]] # 21